#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import re
oltip = {
    '阳江阳春春湾传输机房-OLT001-HW-MA5680T':'172.28.7.4',
    '阳江海陵岛闸坡综合楼-OLT001-HW-MA5680T':'172.28.5.4',
    '阳江江城观光路传输机楼-OLT001-HW-MA5680T':'172.28.0.132',
    '阳江江城新机楼-OLT001-HW-MA5680T':'172.28.3.4',
    '阳江阳春春城传输机楼-OLT001-HW-MA5680T':'172.28.2.132',
    '阳江阳春移动综合楼-OLT001-HW-MA5680T':'172.28.2.4',
    '阳江阳东阳东传输机房-OLT001-HW-MA5680T':'172.28.4.132',
    '阳江阳西传输机楼-OLT001-HW-MA5680T':'172.28.1.4',
    '阳江江城三环路传输机房-OLT001-HW-MA5680T':'172.28.4.4',
    '阳江阳西上洋传输机房-OLT001-HW-MA5680T':'172.28.6.132',
    '阳江江城平岗传输机楼-OLT001-HW-MA5680T':'172.28.7.132',
    '阳江阳西2汇聚机房-OLT001-HW-MA5680T':'172.28.1.132',
    '阳江海陵岛海陵技工学校-OLT001-HW-MA5680T':'172.28.8.4',
    '阳江阳西传输机楼-OLT002-HW-MA5680T':'172.28.12.132',
    '阳江阳西2汇聚机房-OLT002-HW-MA5680T':'172.28.12.4',
    '阳江市阳东县东平基站2F传输-OLT001-HW-MA5680T':'172.28.14.132',
    '阳江阳东阳东传输机房-OLT002-HW-MA5680T':'172.28.9.4',
    '阳江市阳西县程村中学基站1F传输-OLT001-HW-MA5680T':'172.28.13.132',
    '阳江市海陵区平岗良朝基站1F传输-OLT001-HW-MA5680T':'172.28.14.4',
    '阳江市阳西县溪头汇聚机房1F传输-OLT001-HW-MA5680T':'172.28.13.4',
    '阳江阳春移动综合楼-OLT002-HW-MA5680T':'172.28.11.132',
    '阳江市阳东县北惯基站3F传输-OLT001-HW-MA5680T':'172.28.10.4',
    '阳江市阳东县塘坪基站2F传输-OLT001-HW-MA5680T':'172.28.9.132',
    '阳江阳春三甲传输机房-OLT001-HW-MA5680T':'172.28.17.4',
    '阳江江城麻布演B基站-OLT001-HW-MA5680T':'172.28.15.132',
    '阳江阳春陂面传输机房2F传输-OLT001-HW-MA5680T':'172.28.17.132',
    '阳江阳东三山汇聚机房-OLT001-HW-MA5680T':'172.28.18.132',
    '阳江阳西河北基站-OLT001-HW-MA5680T':'172.28.19.4',
    '阳江阳春移动综合楼-OLT003-HW-MA5680T':'172.28.21.4',
    '阳江阳春春江路基站-OLT001-HW-MA5680T':'172.28.20.4',
    '阳江阳春丽江基站1F传输-OLT001-HW-MA5680T':'172.28.20.132',
    '阳江阳东阳东传输机房-OLT003-HW-MA5680T':'172.28.21.132',
    '阳江阳西沙扒基站-OLT001-HW-MA5680T':'172.28.22.4',
    '阳江阳春岗美传输机房-OLT001-HW-MA5680T':'187.159.252.4',
    '阳江江城观光路传输机楼-OLT002-HW-MA5680T':'187.152.4.4',
    '阳江市阳东那金三路传输机房-OLT001-HW-MA5680T':'187.152.16.4',
    '阳江江城新机楼-OLT002-HW-MA5680T':'187.152.8.4',
    '阳江江城沿江路汇聚机房-OLT001-HW-MA5680T':'187.152.40.4',
    '阳江阳西技校基站-OLT001-HW-MA5680T':'187.152.24.4',
    '阳江阳西新圩传输机房-OLT001-HW-MA5680T':'187.152.20.4',
    '阳江阳东合山传输机房-OLT002-HW-MA5680T':'187.152.36.4',
    '阳江市海陵双捷汇聚机房-OLT001-HW-MA5680T':'187.152.52.4',
    '阳江江城石湾综合楼-OLT003-HW-MA5680T':'187.152.72.4',
    '阳江市阳春春城北汇聚机房-OLT001-HW-MA5680T':'187.152.88.4',
    '阳江市海陵白沙二机楼传输机房-OLT001-HW-MA5680T':'187.152.84.4',
    '阳江市阳春潭水汇聚机房-OLT001-HW-MA5680T':'187.152.60.4',
    '阳江市海陵乐安汇聚机房-OLT001-HW-MA5680T':'187.152.44.4',
    '阳江市阳东红丰汇聚机房-OLT001-HW-MA5680T':'187.152.56.4',
    '阳江市阳东世纪大道汇聚机房-OLT001-HW-MA5680T':'187.152.92.4',
    '阳江海陵岛闸坡综合楼-OLT002-HW-MA5680T':'187.152.96.4',
    '阳江市阳春圭岗汇聚机房-OLT001-HW-MA5680T':'187.152.108.4',
    '阳江江城东门南汇聚机房-OLT001-HW-MA5680T':'187.152.104.4',
    '阳江江城岭东派出所基站-OLT001-HW-MA5680T':'187.152.80.4',
    '阳江海陵岛保利银滩汇聚机房-OLT001-HW-MA5680T':'187.152.160.4',
    '阳江市阳东龙胜路汇聚机房-OLT001-HW-MA5680T':'187.152.144.4',
    '阳江江城坪郊汇聚机房-OLT001-HW-MA5680T':'187.152.116.4',
    '阳江阳春春城传输机楼-OLT002-HW-MA5680T':'187.152.148.4',
    '阳江阳春永宁汇聚机房-OLT001-HW-MA5680T':'187.152.120.4',
    '阳江海陵岛港口高速基站-OLT001-HW-MA5680T':'187.152.172.4',
    '阳江阳东大沟汇聚机房-OLT001-HW-MA5680T':'187.152.176.4',
    '阳江江城环城北汇聚机房-OLT001-HW-MA5680T':'187.152.156.4',
    '阳江阳东雅韶汇聚机房-OLT001-HW-MA5680T':'187.152.192.4',
    '阳江江城平岗传输机楼-OLT002-HW-MA5680T':'187.152.32.4',
    '阳江市江城麻演传输机房-OLT001-HW-MA5680T':'187.152.164.4',
    '阳江阳春城东大道传输机房-OLT001-HW-MA5680T':'187.152.168.4',
    '阳江海陵埠场汇聚机房-OLT001-HW-MA5680T':'187.152.100.4',
    '阳江阳春马水汇聚机房-OLT001-HW-MA5680T':'187.152.188.4',
    '阳江阳春河朗基站-OLT001-HW-MA5608T':'187.152.224.4',
    '阳江阳东县大八汇聚机房-OLT001-HW-MA5680T':'187.152.200.4',
    '阳江江城铁通环城南汇聚机房-OLT001-HW-MA5680T':'187.152.216.4',
    '阳江市阳春合水汇聚机房-OLT001-HW-MA5680T':'187.153.96.4',
    '阳江阳春石望基站-OLT001-HW-MA5608T':'187.152.228.4',
    '阳江阳西金湖湾传输机房-OLT001-HW-MA5680T':'187.153.108.4',
    '阳江阳东育才路汇聚机房-OLT001-HW-MA5680T':'187.152.132.4',
    '阳江阳春岗美传输机房-OLT002-HW-MA5680T':'187.153.0.4',
    '阳江江城铁通雨田传输机房-OLT001-HW-MA5680T':'187.153.40.4',
    '阳江江城铁通关口局传输机房-OLT001-HW-MA5680T':'187.153.44.4',
    '阳江江城铁通麻演传输机房-OLT001-HW-MA5680T':'187.153.72.4',
    '阳江阳春铁通河西传输机房-OLT001-HW-MA5680T':'187.153.84.4',
    '阳江阳东铁通大令传输机房-OLT001-HW-MA5680T':'187.153.24.4',
    '阳江江城铁通城西传输机房-OLT001-HW-MA5680T':'187.153.28.4',
    '阳江阳春铁通城云路传输机房-OLT001-HW-MA5680T':'187.153.64.4',
    '阳江阳春铁通城北传输机房-OLT001-HW-MA5680T':'187.153.60.4',
    '阳江阳东新洲汇聚机房-OLT002-HW-MA5680T':'187.153.148.4',
    '阳江阳春松柏汇聚机房-OLT001-HW-MA5680T':'187.153.172.4',
    '阳江阳春铁通通信楼传输机房-OLT001-HW-MA5680T':'187.153.68.4',
    '阳江阳春中朗基站-OLT001-HW-MA5680T':'187.153.168.4',
    '阳江江城东门南汇聚机房-OLT002-HW-MA5680T':'187.153.8.4',
    '阳江阳东北惯汇聚机房-OLT001-HW-MA5680T':'187.153.224.4',
    '阳江阳春东莞工业园汇聚机房-OLT001-HW-MA5680T':'187.153.220.4',
    '阳江阳东三山汇聚机房-OLT002-HW-MA5680T':'187.153.200.4',
    '阳江市阳春潭水汇聚机房-OLT002-HW-MA5680T':'187.153.164.4',
    '阳江阳春城东大道传输机房-OLT002-HW-MA5680T':'187.153.156.4',
    '阳江江城沿江路汇聚机房-OLT002-HW-MA5680T':'187.153.128.4',
    '阳江阳春三甲传输机房-OLT002-HW-MA5680T':'187.153.12.4',
    '阳江阳西程村汇聚机房-OLT002-HW-MA5680T':'187.153.232.4',
    '阳江江城金郊汇聚机房-OLT001-HW-MA5680T':'187.153.216.4',
    '阳江市江城城南汇聚机房-OLT002-HW-MA5680T':'187.153.124.4',
    '阳江阳西程村汇聚机房-OLT001-HW-MA5680T':'187.152.124.4',
    '阳江阳春陂面传输机房2F传输-OLT002-HW-MA5680T':'187.152.236.4',
    '阳江市阳西县溪头汇聚机房1F传输-OLT002-HW-MA5680T':'187.152.252.4',
    '阳江市海陵双捷汇聚机房-OLT002-HW-MA5680T':'187.153.120.4',
    '阳江江城西平南基站-OLT001-HW-MA5608T':'187.154.24.4',
    '阳江江城三环中汇聚机房-OLT001-HW-MA5680T':'187.153.240.4',
    '阳江江城市三院基站-OLT001-HW-MA5680T':'187.154.8.4',
    '阳江江城新中医院汇聚机房-OLT001-HW-MA5680T':'187.154.12.4',
    '阳江阳东阳东基站-OLT001-HW-MA5608T':'187.154.76.4',
    '阳江阳东田畔基站-OLT001-HW-MA5680T':'187.154.72.4',
    '阳江阳东塘围基站-OLT001-HW-MA5608T':'187.154.68.4',
    '阳江江城龙涛基站-OLT001-HW-MA5680T':'187.154.96.4',
    '阳江江城德信华城基站-OLT001-HW-MA5680T':'187.154.92.4',
    '阳江江城刀具城北基站-OLT001-HW-MA5680T':'187.154.84.4',
    '阳江江城太傅路基站-OLT001-HW-MA5680T':'187.154.104.4',
    '阳江阳西奋兴中学汇聚机房-OLT001-HW-MA5680T':'187.154.148.4',
    '阳江阳西邮政接入机房-OLT001-HW-MA5680T':'187.154.152.4',
    '阳江阳春职业中学基站-OLT001-HW-MA5608T':'187.154.80.4',
    '阳江阳春东湖广场基站-OLT001-HW-MA5608T':'187.154.40.4',
    '阳江阳东永兴二路基站-OLT001-HW-MA5680T':'187.154.168.4',
    '阳江阳春春湾新基站-OLT001-HW-MA5680T':'187.154.108.4',
    '阳江阳春旗尾街基站-OLT001-HW-MA5680T':'187.154.112.4',
    '阳江阳春兴华路汇聚机房-OLT001-HW-MA5680T':'187.153.244.4',
    '阳江阳东永兴六路基站-OLT001-HW-MA5680T':'187.154.172.4',
    '阳江阳东大沟汇聚机房-OLT002-HW-MA5680T':'187.153.136.4',
    '阳江阳东雅韶汇聚机房-OLT002-HW-MA5680T':'187.153.132.4',
    '阳江市阳东龙胜路汇聚机房-OLT002-HW-MA5680T':'187.153.180.4',
    '阳江阳东阳江监狱OLT（一体化机柜）-OLT001-HW-MA5608T':'187.154.208.4',
    '阳江阳西河南基站-OLT001-HW-MA5680T':'187.154.124.4',
    '阳江阳西书村基站-OLT001-HW-MA5680T':'187.154.132.4',
    '阳江阳春同兴路基站-OLT001-HW-MA5680T':'187.154.116.4',
    '阳江阳西凯旋豪庭（一体化机柜）-OLT001-HW-MA5608T':'187.154.244.4',
    '阳江阳东东平汇聚机房-OLT002-HW-MA5680T':'187.153.236.4',
    '阳江阳西阳盐基站-OLT001-HW-MA5680T':'187.154.156.4',
    '阳江江城那格基站-OLT001-HW-MA5680T':'187.154.100.4',
    '阳江江城金山路车城OLT（一体化机柜）-OLT001-HW-MA5608T':'187.154.200.4',
    '阳江阳春锦湖花园基站-OLT001-HW-MA5608T':'187.154.48.4',
    '阳江海陵岛敏捷地产汇聚机房-OLT001-HW-MA5680T':'187.155.0.4',
    '阳江江城东钵基站-OLT001-HW-MA5680T':'187.155.72.4',
    '阳江阳西太子酒店基站-OLT001-HW-MA5680T':'187.155.44.4',
    '阳江阳西马村基站-OLT001-HW-MA5680T':'187.155.16.4',
    '阳江江城石湾路汇聚机房-OLT001-HW-MA5680T':'187.154.224.4',
    '阳江阳春莲平路汇聚机房-OLT001-HW-MA5680T':'187.154.176.4',
    '阳江阳春石望汇聚机房-OLT001-HW-MA5680T':'187.155.24.4',
    '阳江阳东兴宁路汇聚机房-OLT001-HW-MA5680T':'187.155.40.4',
    '阳江阳西白土基站-OLT001-HW-MA5608T':'187.155.20.4',
    '阳江阳西和平宾馆基站-OLT001-HW-MA5608T':'187.155.76.4',
    '阳江海陵闸坡基站-OLT001-HW-MA5680T':'187.154.88.4',
    '阳江阳春滨江路西基站-OLT001-HW-MA5680T':'187.154.212.4',
    '阳江阳西沙扒码头基站-OLT001-HW-MA5680T':'187.154.128.4',
    '阳江江城尤鱼桥基站-OLT001-HW-MA5680T':'187.155.8.4',
    '阳江阳春硫铁矿基站-OLT001-HW-MA5680T':'187.155.104.4',
    '阳江阳春新竹路汇聚机房-OLT001-HW-MA5680T':'187.155.152.4',
    '阳江阳东教师进修学校基站-OLT001-HW-MA5680T':'187.154.60.4',
    '阳江阳东新江东路基站-OLT001-HW-MA5680T':'187.154.216.4',
    '阳江江城金郊木材市场基站-OLT001-HW-MA5680T':'187.154.228.4',
    '阳江江城金鸡桥基站-OLT001-HW-MA5680T':'187.155.144.4',
    '阳江江城狮子山基站-OLT001-HW-MA5680T':'187.155.4.4',
    '阳江江城新二中汇聚机房-OLT001-HW-MA5680T':'187.156.0.4',
    '阳江阳西蒲牌基站-OLT001-HW-MA5680T':'187.154.160.4',
    '阳江江城在水一方（一体化机柜）-OLT001-HW-MA5608T':'187.155.172.4',
    '阳江江城海阳基站-OLT001-HW-MA5680T':'187.155.28.4',
    '阳江阳春东湖天下(一体化机柜)-OLT001-HW-MA5608T':'187.155.96.4',
    '阳江阳春铂金湾(一体化机柜)-OLT001-HW-MA5608T':'187.155.92.4',
    '阳江江城锦绣江南(一体化机柜)-OLT001-HW-MA5608T':'187.155.84.4',
    '阳江江城湖湾华庭(一体化机柜)-OLT001-HW-MA5608T':'187.155.184.4',
    '阳江江城吉祥西路汇聚机房-OLT001-HW-MA5680T':'187.154.196.4',
    '阳江阳春金鼎花园(一体化机柜)-OLT001-HW-MA5608T':'187.156.8.4',
    '阳江阳春盛世豪庭(一体化机柜)-OLT001-HW-MA5608T':'187.156.12.4',
    '阳江江城漠江花园(一体化机柜)-OLT001-HW-MA5608T':'187.155.176.4',
    '阳江阳西菁华园(一体化机柜)-OLT001-HW-MA5608T':'187.155.252.4',
    '阳江阳西联新基站-OLT001-HW-MA5608T':'187.155.12.4',
    '阳江阳东东城营业厅(一体化机柜)-OLT001-HW-MA5608T':'187.155.196.4',
    '阳江阳西张飞温泉城(一体化机柜)-OLT001-HW-MA5608T':'187.156.88.4',
    '阳江阳西田安村委会(一体化机柜)-OLT001-HW-MA5608T':'187.155.224.4',
    '阳江江城保利罗兰香谷(一体化机柜)-OLT001-HW-MA5608T':'187.156.24.4',
    '阳江阳春长兴花园(一体化机柜)-OLT001-HW-MA5608T':'187.155.100.4',
    '阳江阳东东泰花园(一体化机柜)-OLT001-HW-MA5608T':'187.155.192.4',
    '阳江阳西马车村委会(一体化机柜)-OLT001-HW-MA5608T':'187.155.220.4',
    '阳江江城山水一品(一体化机柜)-OLT001-HW-MA5608T':'187.156.36.4',
    '阳江阳西南山海村委会(一体化机柜)-OLT001-HW-MA5608T':'187.156.80.4',
    '阳江阳春莲平路汇聚机房-OLT002-HW-MA5680T':'187.156.120.4',
    '阳江阳春尚品爱琴海(一体化机柜)-OLT001-HW-MA5608T':'187.156.40.4',
    '阳江阳春兴华路汇聚机房-OLT002-HW-MA5680T':'187.156.116.4',
    '阳江阳东工业大道传输机房-OLT001-HW-MA5680T':'187.153.104.4',
    '阳江阳西双鱼城基站(一体化机柜)-OLT001-HW-MA5608T':'187.155.232.4',
    '阳江江城名扬国际(一体化机柜)-OLT001-HW-MA5608T':'187.156.32.4',
    '阳江江城阳光马德里(一体化机柜)-OLT001-HW-MA5608T':'187.155.168.4',
    '阳江江城丰怡豪庭(一体化机柜)-OLT001-HW-MA5608T':'187.156.28.4',
    '阳江阳西未来城F栋(一体化机柜)-OLT001-HW-MA5608T':'187.156.84.4',
    '阳江江城石湾南B汇聚机房-OLT001-HW-MA5680T':'187.156.180.4',
    '阳江阳东合山2汇聚机房-OLT001-HW-MA5680T':'187.156.244.4',
    '阳江阳东京源上景（一体化机柜）-OLT001-HW-MA5608T':'187.155.188.4',
    '阳江阳春春城扶民村委会（一体化机柜）-OLT001-HW-MA5608T':'187.156.96.4',
    '阳江阳西看守所接入机房-OLT001-HW-MA5680T':'187.154.28.4',
    '阳江阳春八甲俄颈村委会(一体化机柜)-OLT001-HW-MA5608T':'187.155.228.4',
    '阳江江城艺苑宾馆汇聚机房-OLT002-HW-MA5680T':'187.157.16.4',
    '阳江阳春新世界小区(一体化机柜)-OLT001-HW-MA5608T':'187.155.164.4',
    '阳江阳春岗美轮水村委会（一体化机柜）-OLT001-HW-MA5608T':'187.156.4.4',
    '阳江阳春庞垌村委会(一体化机柜)-OLT001-HW-MA5608T':'187.156.92.4',
    '阳江阳东合山传输机房-OLT001-HW-MA5680T':'172.28.5.132',
    '阳江江城石湾综合楼-OLT001-HW-MA5680T':'172.28.0.4',
    '阳江江城江城传输机房-OLT001-HW-MA5680T':'172.28.3.132',
    '阳江市海陵区白蒲基站6F传输-OLT001-HW-MA5680T':'172.28.10.132',
    '阳江市阳春市河口汇聚机房2F传输-OLT001-HW-MA5680T':'172.28.8.132',
    '阳江市阳春市朝阳路基站4F传输-OLT001-HW-MA5680T':'172.28.11.4',
    '阳江阳春八甲汇聚机房2F传输-OLT001-HW-MA5680T':'172.28.16.132',
    '阳江江城石湾综合楼-OLT002-HW-MA5680T':'172.28.19.132',
    '阳江阳西儒洞汇聚机房1F传输-OLT001-HW-MA5680T':'172.28.15.4',
    '阳江江城新中医院基站8F传输-OLT001-HW-MA5680T':'187.152.12.4',
    '阳江海陵岛丹济汇聚机房-OLT001-HW-MA5680T':'187.152.28.4',
    '阳江市江城城南汇聚机房-OLT001-HW-MA5680T':'187.152.76.4',
    '阳江阳东新洲汇聚机房-OLT001-HW-MA5680T':'187.152.64.4',
    '阳江阳西祥顺路汇聚机房-OLT001-HW-MA5680T':'187.152.48.4',
    '阳江阳西塘口汇聚机房-OLT001-HW-MA5680T':'187.152.136.4',
    '阳江海陵白沙汇聚机房-OLT001-HW-MA5680T':'187.152.140.4',
    '阳江市江城城西传输机房-OLT001-HW-MA5680T':'187.152.128.4',
    '阳江阳春双窖汇聚机房-OLT001-HW-MA5680T':'187.152.220.4',
    '阳江阳春南新大道汇聚机房-OLT001-HW-MA5680T':'187.152.208.4',
    '阳江阳西铁通镇安路传输机房-OLT001-HW-MA5680T':'187.153.76.4',
    '阳江江城铁通金郊传输机房-OLT001-HW-MA5680T':'187.153.92.4',
    '阳江阳春春湾传输机房-OLT002-HW-MA5680T':'187.152.232.4',
    '阳江阳东北惯汇聚机房-OLT002-HW-MA5680T':'187.153.228.4',
    '阳江阳春南新大道汇聚机房-OLT002-HW-MA5680T':'187.153.160.4',
    '阳江阳西桥平路传输机房-OLT001-HW-MA5680T':'187.153.192.4',
    '阳江阳东东平汇聚机房-OLT001-HW-MA5680T':'187.153.212.4',
    '阳江海陵中学汇聚机房-OLT001-HW-MA5680T':'187.153.248.4',
    '阳江江城景湖花园OLT(一体化机柜)-OLT001-HW-MA5608T':'187.154.184.4',
    '阳江江城麻演传输机房-OLT002-HW-MA5680T':'187.153.184.4',
    '阳江阳春新马水汇聚机房-OLT001-HW-MA5680T':'187.154.16.4',
    '阳江阳春阳春大道基站-OLT001-HW-MA5680T':'187.154.120.4',
    '阳江江城广丰花园OLT（一体化机柜）-OLT001-HW-MA5608T':'187.154.192.4',
    '阳江江城漠江路汇聚机房-OLT001-HW-MA5680T':'187.155.124.4',
    '阳江江城金城宾馆汇聚机房-OLT001-HW-MA5680T':'187.155.128.4',
    '阳江江城华美纸箱厂基站-OLT001-HW-MA5680T':'187.155.148.4',
    '阳江海陵闸坡渔村汇聚机房-OLT001-HW-MA5680T':'187.152.68.4',
    '阳江江城新都汇(一体化机柜)-OLT001-HW-MA5608T':'187.155.236.4',
    '阳江阳西旧仓基站(一体化机柜)-OLT001-HW-MA5608T':'187.155.216.4',
    '阳江阳春锦绣花园(一体化机柜)-OLT001-HW-MA5608T':'187.155.88.4',
    '阳江阳东东平营业厅(一体化机柜)-OLT001-HW-MA5608T':'187.155.208.4',
    '阳江江城新江花园(一体化机柜)-OLT001-HW-MA5608T':'187.155.180.4',
    '阳江江城御景豪园(一体化机柜)-OLT001-HW-MA5608T':'187.156.20.4',
    '阳江阳西御景湾水木源华(一体化机柜)-OLT001-HW-MA5608T':'187.157.56.4',
    '阳江江城铁通岭东传输机房-OLT001-ZX-C300':'187.153.52.4',
    '阳江江城铁通上元春传输机房-OLT001-ZX-C300':'187.153.56.4',
    '阳江江城铁通石湾北传输机房-OLT001-ZX-C300':'187.153.36.4',
    '阳江阳东铁通北惯传输机房-OLT001-ZX-C300':'187.153.20.4',
    '阳江阳东铁通工业园传输机房-OLT001-ZX-C300':'187.153.16.4',
    '阳江阳春河邦基站-OLT001-FH-AN5516-01':'187.155.112.4',
    '阳江阳春春湾大道基站-OLT001-FH-AN5516-04':'187.154.36.4',
    '阳江阳春大陈基站-OLT001-FH-AN5516-01':'187.155.108.4',
    '阳江阳春附城T基站-OLT001-FH-AN5516-01':'187.155.48.4',
    '阳江阳春白马坪基站-OLT001-FH-AN5516-04':'187.154.32.4',
    '阳江阳春龙门基站-OLT001-FH-AN5516-01':'187.155.52.4',
    '阳江阳春山坪基站-OLT001-FH-AN5516-01':'187.155.68.4',
    '阳江阳春交简基站-OLT001-FH-AN5516-01':'187.155.60.4',
    '阳江阳春气象局汇聚机房-OLT001-FH-AN5516-01':'187.155.248.4',
    '阳江阳春卫国基站-OLT001-FH-AN5516-01':'187.155.64.4',
    '阳江阳春河朗基站-OLT001-FH-AN5516-01':'187.156.184.4',
    '阳江阳春潭水良垌村委会（一体化机柜）-OLT001-FH-AN5516-04':'187.156.228.4',
    '阳江阳春春湾下山村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.204.4',
    '阳江阳春凤来村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.224.4',
    '阳江阳春丰垌村委会（一体化机柜）-OLT001-FH-AN5516-04':'187.156.216.4',
    '阳江阳春营讯村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.212.4',
    '阳江阳春茶河村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.192.4',
    '阳江阳春西岸花园(一体化机柜)-OLT001-FH-AN5516-04':'187.157.8.4',
    '阳江阳春西岸村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.157.60.4',
    '阳江阳春平东村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.208.4',
    '阳江阳春车田村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.200.4',
    '阳江阳春阳春监狱(一体化机柜)-OLT001-FH-AN5516-04':'187.157.0.4',
    '阳江阳西南堡基站-OLT001-FH-AN5516-01':'187.155.116.4',
    '阳江阳西太平基站-OLT001-FH-AN5516-04':'187.155.132.4',
    '阳江阳西菩提基站-OLT001-FH-AN5516-01':'187.155.120.4',
    '阳江阳西长岐村基站(一体化机柜)-OLT001-FH-AN5516-04':'187.156.148.4',
    '阳江阳西情侣路基站-OLT001-FH-AN5516-01':'187.155.136.4',
    '阳江阳西源河房地产(一体化机柜)-OLT001-FH-AN5516-04':'187.156.248.4',
    '阳江阳西西一基站(一体化机柜)-OLT001-FH-AN5516-04':'187.156.144.4',
    '阳江阳西福达公馆(一体化机柜)-OLT001-FH-AN5516-04':'187.157.32.4',
    '阳江阳西石楼村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.157.128.4',
    '阳江阳东那金七路基站-OLT001-FH-AN5516-04':'187.154.64.4',
    '阳江阳西鸿润小区(一体化机柜)-OLT001-FH-AN5516-04':'187.157.88.4',
    '阳江阳东锦兴汇聚机房-OLT001-FH-AN5516-01':'187.155.200.4',
    '阳江阳西粤丰广场(一体化机柜)-OLT001-FH-AN5516-04':'187.157.104.4',
    '阳江阳东北惯B基站-OLT001-FH-AN5516-04':'187.154.52.4',
    '阳江阳东高罗村委会（一体化机柜）-OLT001-FH-AN5516-04':'187.156.64.4',
    '阳江阳东合山水厂基站-OLT001-FH-AN5516-04':'187.154.56.4',
    '阳江江城春雨露基站-OLT001-FH-AN5516-01':'187.155.140.4',
    '阳江江城漠江花园汇聚机房-OLT001-FH-AN5516-01':'187.156.104.4',
    '阳江江城平岗营业厅(一体化机柜)-OLT001-FH-AN5516-04':'187.155.204.4',
    '阳江江城美仑广场(一体化机柜)-OLT001-FH-AN5516-04':'187.157.12.4',
    '阳江江城东山南汇聚机房-OLT001-FH-AN5516-01':'187.156.100.4',
    '阳江海陵金沙湾汇聚机房-OLT001-FH-AN5516-01':'187.156.132.4',
    '阳江海陵北宿村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.152.4',
    '阳江海陵东二村委会(一体化机柜)-OLT001-FH-AN5516-04':'187.156.156.4'
}

def olt_input():# 定义输入函数
    olt_str = input('\n输入索引号 : \n')# 打印
    while olt_str == '':
        olt_str = input('\n输入索引号 : \n')# 打印
    else:
        return olt_str
        
def olt_name(get_name):#定义取出OLT名字函数
    oltlist = []#定义OLT筛选数组
    for item in oltip.keys():# 循环查询字典
        if get_name in item:# 如果输入的字符包含在字典内
            oltlist.append(item)#写入关键字筛选出的数组
    if len(oltlist) == 0:#判断没查到相关信息
        print('\n查无相关数据!\n')
        return ''
    else:
        for item2,elmemt in enumerate(oltlist):#遍历数组
            print('\n索引 : ',end = '')#打印
            print(item2,oltlist[item2])#打印索引 和 值
        if len(oltlist) == 1:#判断OLT列表只有一个
            print(oltlist[0])#打印
            return oltlist[0]#返回OLT名
        else:#否则
            item3 = input('\n输入索引号 : \n')
            while not re.findall('^[0-9]*$',item3):
                item3 = input('\n数目只能是数字，请重新输入：')
            try:
                item5 = int(item3)
            except:
                print('\n输入有误!,输出首次查找到的OLT!\n')
                print(oltlist[0])
                return oltlist[0]
            if item5 in range(len(oltlist)):
                print(oltlist[item5])
                return oltlist[item5]
            else:
                print('\n输入有误!,输出首次查找到的OLT!\n')
                print(oltlist[0])
                return oltlist[0]
                
def olt_ip(get_name):#定义取出OLT名字函数
    if get_name == '':
        return ''
        print('\n参数为空,请重新查询\n')
    else:
        for item in oltip.keys():# 循环查询字典
            if get_name in item:# 如果输入的字符包含在字典内
                print('\ntelnet ' + oltip[item])#反馈OLT名称
                return oltip[item]

def olt_type(get_name):#定义查OLT设备类型的函数
    print('\n-设备类型 : ',end='')#打印
    if 'HW' in get_name:#判断带有HW字样为华为设备
        print('HW-华为\n')
    elif 'FH' in get_name:#判断带有HW字样为烽火设备
        print('FH-烽火\n')
    elif 'ZX' in get_name:#判断带有HW字样为中兴设备
        print('ZX-中兴\n')

while 1:
    olt_key = olt_input()#调用输入函数
    olt_key = olt_name(olt_key)#调用OLT名函数
    olt_ip(olt_key)#调用OLTIP函数
    olt_type(olt_key)#调用打印设备类型函数

#  待增加功能 输出颜色对应不同设备 输出不同设备型号 输出区域 输出设备机房分类机房基站下沉 
